# GetObjectVariablePoint

## Description
Returns the value of a Vectorworks object property. Used with properties returning a 2D or 3D point value.<BR>
<BR>
For specific object selector index values, see the Appendix.

```pascal
FUNCTION GetObjectVariablePoint(
				h                       : HANDLE;
				index                   : INTEGER;
				VAR outPx, outPy, outPz : REAL): BOOLEAN;
```

```python
def vs.GetObjectVariablePoint(h, index):
    return (BOOLEAN, outP)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|index|INTEGER|Object property index.|
|outP|REAL|Return the object variable data point.|

## Remarks
In python scripting, the point 'outP' will be returned as tuple (x,y,z)

## See Also
VS Functions:
SetObjectVariablePoint
| GetObjectVariableBoolean
| SetObjectVariableBoolean
| GetObjectVariableHandle
| SetObjectVariableHandle
| GetObjectVariableInt
| SetObjectVariableInt
| GetObjectVariableLongInt
| SetObjectVariableLongInt
| GetObjectVariableReal
| SetObjectVariableReal
| GetObjectVariableString
| SetObjectVariableString

## Version
Availability: from Vectorworks 2011

## Category
* Object Info